<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 4, 2026, 02:02 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7211"
      ~ ipv4_addresses                       = [
            # (6 unchanged elements hidden)
            [],
          - [
              - "10.0.128.11",
            ],
          + [
              + "10.0.128.11",
              + "10.0.128.10",
            ],
          + [],
          + [
              + "10.0.144.66",
            ],
          + [],
          + [],
          + [],
          + [],
          + [],
          + [],
          + [],
          + [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7211",
            ],
          + [
              + "fe80::b0b6:39ff:fe2c:9e8",
            ],
          + [
              + "fe80::8e3:e4ff:fe7d:302d",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          - "5E:48:0B:F5:81:8F",
          - "22:42:A9:00:92:D6",
          + "C2:E3:4E:06:A6:D1",
          + "9E:B9:0D:FC:92:48",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:11",
          + "B2:B6:39:2C:09:E8",
          + "0A:E3:E4:7D:30:2D",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-cp-1"
      ~ network_interface_names              = [
            # (7 unchanged elements hidden)
            "eth0",
          + "cilium_net",
          + "cilium_host",
          + "lxcc574591987fc",
          + "lxc58c5b6d980c8",
          + "lxcb4ad6a601114",
          + "lxcde4a90ace2f3",
          + "lxc16d08f71fd74",
          + "lxc75ee3653d411",
          + "lxc_health",
          + "lxc0525b2e9dc51",
          + "lxcbf3e59daed64",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7212"
      ~ ipv4_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "10.0.128.12",
            ],
          + [],
          + [
              + "10.0.145.61",
            ],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7212",
            ],
          + [
              + "fe80::1004:cff:fe0a:71f",
            ],
          + [
              + "fe80::54a9:45ff:fecf:97f6",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          - "1A:4D:5D:43:64:6F",
          - "2E:5D:D9:D8:BA:AE",
          + "AA:9E:B3:45:5C:F0",
          + "C2:D5:E0:34:53:CB",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:12",
          + "12:04:0C:0A:07:1F",
          + "56:A9:45:CF:97:F6",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-cp-2"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          - "eth0",
          + "ens18",
          + "cilium_net",
          + "cilium_host",
          + "lxc_health",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7213"
      ~ ipv4_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "10.0.128.13",
            ],
          + [],
          + [
              + "10.0.148.157",
            ],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7213",
            ],
          + [
              + "fe80::9c7f:a0ff:fe81:6362",
            ],
          + [
              + "fe80::5ce5:faff:fe1a:41b9",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          - "BA:52:3A:C7:4A:50",
          - "0A:6E:57:A5:40:E3",
          + "26:39:FC:DF:6D:07",
          + "F6:AD:E7:75:5D:67",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:13",
          + "9E:7F:A0:81:63:62",
          + "5E:E5:FA:1A:41:B9",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-cp-3"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          - "eth0",
          + "ens18",
          + "cilium_net",
          + "cilium_host",
          + "lxc_health",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ ipv4_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "10.0.128.21",
            ],
          + [],
          + [
              + "10.0.146.49",
            ],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7221",
            ],
          + [
              + "fe80::40e4:57ff:fe41:6065",
            ],
          + [
              + "fe80::5850:a5ff:fe0a:449",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          - "5E:03:A4:09:21:8D",
          - "66:47:37:3F:A5:16",
          + "AE:E4:90:F0:40:C4",
          + "E2:9D:EA:44:5C:BF",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:21",
          + "42:E4:57:41:60:65",
          + "5A:50:A5:0A:04:49",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          - "eth0",
          + "ens18",
          + "cilium_net",
          + "cilium_host",
          + "lxc_health",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
      ~ ipv4_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "10.0.128.22",
            ],
          + [],
          + [
              + "10.0.149.23",
            ],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7222",
            ],
          + [
              + "fe80::24a8:12ff:fee5:66be",
            ],
          + [
              + "fe80::2022:5eff:fefa:bf28",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          - "26:77:F1:FE:76:1B",
          - "BE:DF:48:A0:A3:03",
          + "52:28:FB:B8:A1:CD",
          + "2A:4C:F3:DC:60:4E",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:22",
          + "26:A8:12:E5:66:BE",
          + "22:22:5E:FA:BF:28",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          - "eth0",
          + "ens18",
          + "cilium_net",
          + "cilium_host",
          + "lxc_health",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
      ~ ipv4_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "10.0.128.23",
            ],
          + [],
          + [
              + "10.0.147.190",
            ],
          + [],
          + [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7223",
            ],
          + [
              + "fe80::f02a:3fff:fe08:5a76",
            ],
          + [
              + "fe80::f0b9:39ff:feae:9094",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          - "52:99:F1:51:CC:84",
          - "72:40:DE:60:0D:F9",
          + "42:19:0D:5E:79:A7",
          + "6E:65:D6:0C:1B:A9",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:72:23",
          + "F2:2A:3F:08:5A:76",
          + "F2:B9:39:AE:90:94",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-3"
      ~ network_interface_names              = [
            # (6 unchanged elements hidden)
            "ip6tnl0",
          - "eth0",
          + "ens18",
          + "cilium_net",
          + "cilium_host",
          + "lxc_health",
          + "lxcfe4a0ad57d80",
          + "lxcc84cfeca5755",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

      ~ cpu {
          + flags        = []
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cluster.onepassword_item.talosconfig[0] will be updated in-place
  ~ resource "onepassword_item" "talosconfig" {
        id         = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/vxdy5ydalqovc3fwbhnwi44tla"
      ~ note_value = (sensitive value)
      + password   = (sensitive value)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7211" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.11",
              - "10.0.128.10",
            ],
          - [],
          - [
              - "10.0.144.66",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7211",
            ],
          - [
              - "fe80::b0b6:39ff:fe2c:9e8",
            ],
          - [
              - "fe80::8e3:e4ff:fe7d:302d",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "C2:E3:4E:06:A6:D1",
          - "9E:B9:0D:FC:92:48",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:11",
          - "B2:B6:39:2C:09:E8",
          - "0A:E3:E4:7D:30:2D",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-cp-1"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "lxcc574591987fc",
          - "lxc58c5b6d980c8",
          - "lxcb4ad6a601114",
          - "lxcde4a90ace2f3",
          - "lxc16d08f71fd74",
          - "lxc75ee3653d411",
          - "lxc_health",
          - "lxc0525b2e9dc51",
          - "lxcbf3e59daed64",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7211-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated      = 2000 -> 3000
          ~ floating       = 2000 -> 3000
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7212" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.12",
            ],
          - [],
          - [
              - "10.0.145.61",
            ],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7212",
            ],
          - [
              - "fe80::1004:cff:fe0a:71f",
            ],
          - [
              - "fe80::54a9:45ff:fecf:97f6",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "AA:9E:B3:45:5C:F0",
          - "C2:D5:E0:34:53:CB",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:12",
          - "12:04:0C:0A:07:1F",
          - "56:A9:45:CF:97:F6",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-cp-2"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7212-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated      = 2000 -> 3000
          ~ floating       = 2000 -> 3000
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7213" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.13",
            ],
          - [],
          - [
              - "10.0.148.157",
            ],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7213",
            ],
          - [
              - "fe80::9c7f:a0ff:fe81:6362",
            ],
          - [
              - "fe80::5ce5:faff:fe1a:41b9",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "26:39:FC:DF:6D:07",
          - "F6:AD:E7:75:5D:67",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:13",
          - "9E:7F:A0:81:63:62",
          - "5E:E5:FA:1A:41:B9",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-cp-3"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7213-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated      = 2000 -> 3000
          ~ floating       = 2000 -> 3000
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7221" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.21",
            ],
          - [],
          - [
              - "10.0.146.49",
            ],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7221",
            ],
          - [
              - "fe80::40e4:57ff:fe41:6065",
            ],
          - [
              - "fe80::5850:a5ff:fe0a:449",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "AE:E4:90:F0:40:C4",
          - "E2:9D:EA:44:5C:BF",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:21",
          - "42:E4:57:41:60:65",
          - "5A:50:A5:0A:04:49",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7221-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated      = 7000 -> 6000
          ~ floating       = 7000 -> 6000
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7222" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.22",
            ],
          - [],
          - [
              - "10.0.149.23",
            ],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7222",
            ],
          - [
              - "fe80::24a8:12ff:fee5:66be",
            ],
          - [
              - "fe80::2022:5eff:fefa:bf28",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "52:28:FB:B8:A1:CD",
          - "2A:4C:F3:DC:60:4E",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:22",
          - "26:A8:12:E5:66:BE",
          - "22:22:5E:FA:BF:28",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7222-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated      = 7000 -> 6000
          ~ floating       = 7000 -> 6000
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7223" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.23",
            ],
          - [],
          - [
              - "10.0.147.190",
            ],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7223",
            ],
          - [
              - "fe80::f02a:3fff:fe08:5a76",
            ],
          - [
              - "fe80::f0b9:39ff:feae:9094",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "42:19:0D:5E:79:A7",
          - "6E:65:D6:0C:1B:A9",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:23",
          - "F2:2A:3F:08:5A:76",
          - "F2:B9:39:AE:90:94",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-wk-3"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxcfe4a0ad57d80",
          - "lxcc84cfeca5755",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7223-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ memory {
          ~ dedicated      = 11000 -> 10000
          ~ floating       = 11000 -> 10000
            # (3 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.

  ```

  </details>
  
  